/**
 * ! Բինառ(երկուական 0-1, մեթոդ՝ կիսել 2 մասի՝ Դիխոտոմիա ) որոնում։ Տեսակավորված զանգվածում(array sort) փնտրվող տարրը գտնել։
 * 
 * ա) Պարզում ենք տվյալների կառուցվածքի(array) մեջտեղում գտնվող տարրը(middle) և համեմատում ենք մեր փնտրվող բանալու հետ(search or key)․
 * բ) Եթե ​​բանալին փոքր է միջին արժեքից, ապա որոնումը կատարվում է տարրերի առաջին կեսում, հակառակ դեպքում `երկրորդում․
 * գ) Որոնումը կրճատվում է: Ընտրված կեսում, միջին տարրի արժեքը կրկին որոշվում և համեմատվում է բանալու հետ:
 * դ) Գործընթացը շարունակվում է այնքան ժամանակ, մինչև կ գտնվի փնտրվող տարրը կամ որոնման միջակայքը կ դատարկվի:
 * 
 * Bisection method
 */

const array = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28],
    search = 3,
    search_1 = 33;

function binarySerach (array, search) {
    let left = 0,
        right = array.length -1;
    
    while(left < right) {
        const middle = Math.floor((left + right) / 2);

        if(array[middle] >= search ) {
            right = middle
        } else {
            left = middle + 1;
        }
    }

    return array[right] === search ? right : -1;
}

console.dir( binarySerach(array, search))