/**
 * @Currying Դա ֆունկցիայի @refactoring է, որի արդյունքում արգումենտնրի քանակը հասցնում ենք 1-ի։ f(a, b, c) -> f(a)(b)(c)
 * @Curry_Function հետ են վերադարցնում ֆունկցիաների շխթա, որոնցից յուրաքանչյուրը ընդունում է 1 արգումենտ և հաշվարկը ավարտվում է միայն այն ժամանակ երբ կա վերջին արգումենտը։ 
 * 
 * Currying
 * @Arity @Operand Դա ֆունկցիայի արգումենտների քանակն է։
 */

 ///////////////////////////////////////////////////////////
function func(a, b, c) {
    return a * b * c;
}
console.log( func(2,2,2) ) //8
///////////////////////////////////////////////////////////
function func_1(a) {
    return (b) => {
        return (c) => {
            return a * b * c
        }
    }
}
console.log( func_1(1)(2)(3) ) //6
///////////////////////////////////////////////////////////
let val, val_1, val_2;

val = func_1(1)
val_1 = val(2)
val_2 = val_1(3)

console.log('Curring', val_2)
///////////////////////////////////////////////////////////